bookshelf.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-06-09 Sat 18:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Reading List</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Johnny Megahan" />
<meta name="description" content="The reading list of Johnny Megahan."
 />
</head>
<body>
<div id="content">
<h1 class="title">My Reading List</h1>

<div id="outline-container-orge6dbfcd" class="outline-2">
<h2 id="orge6dbfcd">Currently Reading</h2>
<div class="outline-text-2" id="text-orge6dbfcd">
<ul class="org-ul">
<li><a href="http://www.kodanshausa.com/books/9781568364148/">Read Real Japanese (Essays)</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5828538" class="outline-2">
<h2 id="org5828538">Summer Reading Queue</h2>
<div class="outline-text-2" id="text-org5828538">
<ul class="org-ul">
<li><a href="https://profilebooks.com/the-art-of-logic-hb.html">The Art of Logic</a></li>
<li><a href="http://www.math.jhu.edu/~eriehl/context/">Category Theory in Context</a></li>
<li><a href="http://math.mit.edu/~dspivak/teaching/sp18/7Sketches.pdf">Seven Sketches in Compositionality</a></li>
<li><a href="https://www.harpercollins.com/9780060883287/one-hundred-years-of-solitude/">One Hundred Years of Solitude</a></li>
<li><a href="http://www.kodanshausa.com/books/9781568365299/">Read Real Japanese (Fiction)</a></li>
</ul>
</div>
</div>

<div id="outline-container-org76d62a6" class="outline-2">
<h2 id="org76d62a6">Previously Read</h2>
<div class="outline-text-2" id="text-org76d62a6">
<ul class="org-ul">
<li><a href="https://softwarefoundations.cis.upenn.edu/current/index.html">Software Foundations</a></li>
<li><a href="http://www.logicmatters.net/resources/pdfs/GentleIntro.pdf">Category Theory: A Gentle Introduction</a></li>
<li><a href="https://www.cs.kent.ac.uk/people/staff/sjt/TTFP/">Type Theory and Functional Programming</a></li>
<li><a href="https://www.faber.co.uk/9780571283897-the-unconsoled.html">The Unconsoled</a></li>
<li><a href="https://profilebooks.com/how-to-bake-pi.html">How to Bake Pi</a></li>
<li><a href="http://www.kodanshausa.com/books/9781568364155/">Breaking into Japanese Literature</a></li>
<li><a href="https://www.penguinrandomhouse.com/books/115561/the-book-of-general-ignorance-by-john-mitchinson-and-john-lloyd/9780307394910">The Book of General Ignorance</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
